import dv from '..';

/**
 * Localized messages for locale: BG
 */
dv.localize({
  required: 'Полето е задължително.',
  email: 'Моля, въведете валиден email.',
  url: 'Моля, въведете валидно URL.',
  date: 'Моля, въведете валидна дата.',
  dateISO: 'Моля, въведете валидна дата (ISO).',
  number: 'Моля, въведете валиден номер.',
  digits: 'Моля, въведете само цифри.',
  equalTo: 'Моля, въведете същата стойност отново.',
  maxlength: 'Моля, въведете не повече от {0} символа.',
  minlength: 'Моля, въведете поне {0} символа.',
  rangelength: 'Моля, въведете стойност с дължина между {0} и {1} символа.',
  range: 'Моля, въведете стойност между {0} и {1}.',
  max: 'Моля, въведете стойност по-малка или равна на {0}.',
  min: 'Моля, въведете стойност по-голяма или равна на {0}.',
  creditcard: 'Моля, въведете валиден номер на кредитна карта.',
  regex: 'Моля, въведете стойност, която съответства на модела {0}.',
  nonalphamin: 'Моля, въведете поне {0} не-буквени символа.',
});
