import dv from '..';

/**
 * Localized messages for locale: TH
 */
dv.localize({
  required: 'โปรดระบุ',
  email: 'โปรดระบุที่อยู่อีเมล์ที่ถูกต้อง',
  url: 'โปรดระบุ URL ที่ถูกต้อง',
  date: 'โปรดระบุวันที่ ที่ถูกต้อง',
  dateISO: 'โปรดระบุวันที่ ที่ถูกต้อง (ระบบ ISO).',
  number: 'โปรดระบุทศนิยมที่ถูกต้อง',
  digits: 'โปรดระบุจำนวนเต็มที่ถูกต้อง',
  equalTo: 'โปรดระบุค่าเดิมอีกครั้ง',
  maxlength: 'โปรดอย่าระบุค่าที่ยาวกว่า {0} อักขระ',
  minlength: 'โปรดอย่าระบุค่าที่สั้นกว่า {0} อักขระ',
  rangelength: 'โปรดอย่าระบุค่าความยาวระหว่าง {0} ถึง {1} อักขระ',
  range: 'โปรดระบุค่าระหว่าง {0} และ {1}',
  max: 'โปรดระบุค่าน้อยกว่าหรือเท่ากับ {0}',
  min: 'โปรดระบุค่ามากกว่าหรือเท่ากับ {0}',
  creditcard: 'โปรดระบุรหัสบัตรเครดิตที่ถูกต้อง',
  regex: 'กรุณาป้อนค่าที่ตรงกับรูปแบบ {0}',
  nonalphamin: 'กรุณาป้อนอักขระที่ไม่ใช่ตัวอักษรอย่างน้อย {0} ตัว',
});
