import dv from '..';

/**
 * Localized messages for locale: EL
 */
dv.localize({
  required: 'Αυτό το πεδίο είναι υποχρεωτικό.',
  email: 'Παρακαλώ εισάγετε μια έγκυρη διεύθυνση email.',
  url: 'Παρακαλώ εισάγετε ένα έγκυρο URL.',
  date: 'Παρακαλώ εισάγετε μια έγκυρη ημερομηνία.',
  dateISO: 'Παρακαλώ εισάγετε μια έγκυρη ημερομηνία (ISO).',
  number: 'Παρακαλώ εισάγετε έναν έγκυρο αριθμό.',
  digits: 'Παρακαλώ εισάγετε μόνο αριθμητικά ψηφία.',
  equalTo: 'Παρακαλώ εισάγετε την ίδια τιμή ξανά.',
  maxlength: 'Παρακαλώ εισάγετε μέχρι και {0} χαρακτήρες.',
  minlength: 'Παρακαλώ εισάγετε τουλάχιστον {0} χαρακτήρες.',
  rangelength:
    'Παρακαλώ εισάγετε μια τιμή με μήκος μεταξύ {0} και {1} χαρακτήρων.',
  range: 'Παρακαλώ εισάγετε μια τιμή μεταξύ {0} και {1}.',
  max: 'Παρακαλώ εισάγετε μια τιμή μικρότερη ή ίση του {0}.',
  min: 'Παρακαλώ εισάγετε μια τιμή μεγαλύτερη ή ίση του {0}.',
  creditcard: 'Παρακαλώ εισάγετε έναν έγκυρο αριθμό πιστωτικής κάρτας.',
  regex: 'Παρακαλώ εισάγετε μια τιμή που ταιριάζει με το μοτίβο {0}.',
  nonalphamin: 'Παρακαλώ εισάγετε τουλάχιστον {0} μη αλφαβητικούς χαρακτήρες.',
});
