import dv from '..';

/**
 * Localized messages for locale: UR
 */
dv.localize({
  required: 'ان معلومات کا اندراج ضروری ہے',
  email: 'درج کی ہوئی ای میل درست نہیں ہے',
  url: 'درج کیا گیا پتہ درست نہیں ہے',
  date: 'درج کی گئی تاریخ درست نہیں ہے',
  dateISO: 'معیار کے مطابق نہیں ہے (ISO) درج کی گئی تاریخ',
  number: 'درج کیےگئے ہندسے درست نہیں ہیں',
  digits: 'صرف ہندسے اندراج کئے جاسکتے ہیں',
  equalTo: 'اندراج کا موازنہ درست نہیں ہے',
  maxlength: 'زیادہ سے زیادہ {0} کا اندراج کر سکتے ہیں',
  minlength: 'کم سے کم {0} کا اندراج کرنا ضروری ہے',
  rangelength: 'اندراج کا {0} اور {1}کے درمیان ہونا ضروری ہے',
  range: 'اندراج کا {0} اور {1} کے درمیان ہونا ضروری ہے',
  max: 'زیادہ سے زیادہ {0} کا اندراج کر سکتے ہیں',
  min: 'کم سے کم {0} کا اندراج کرنا ضروری ہے',
  creditcard: 'درج کیا گیا کارڈ نمبر درست نہیں ہے',
  regex: 'براہ کرم ایک قدر درج کریں جو پیٹرن {0} سے مماثل ہو۔',
  nonalphamin: 'براہ کرم کم از کم {0} غیر حروف تہجی حروف درج کریں۔',
});
