import dv from '..';

/**
 * Localized messages for locale: HI
 */
dv.localize({
  required: 'आवश्यक फ़ील्ड।',
  email: 'एक वैध ई - मेल पते की प्रविष्टि करें।',
  url: 'कृपया एक वैध वेब पता दर्ज करें।',
  date: 'कृपया कोई मान्य दिनांक दर्ज करें।',
  dateISO: 'कृपया एक मान्य दिनांक (ISO) दर्ज करें।',
  number: 'कृपया सही अंक दर्ज करें।',
  digits: 'केवल संख्याएं दर्ज करें।',
  equalTo: 'मेल नहीं खाता।',
  maxlength: 'अधिक दर्ज न करें {0} वर्णों में से',
  minlength: 'कृपया कम से कम {0} वर्ण दर्ज करें।',
  rangelength: 'कृपया {0} और {1} वर्णों के बीच एक मान दर्ज करें।',
  range: 'कृपया {0} और {1} के बीच एक मान दर्ज करें।',
  max: 'कृपया {0} से कम या उसके बराबर मान दर्ज करें।',
  min: 'कृपया {0} से अधिक या उसके बराबर मान दर्ज करें।',
  creditcard: 'कृपया एक वैध क्रेडिट कार्ड नंबर डालें।',
  regex: 'कृपया पैटर्न {0} से मेल खाने वाला मान दर्ज करें।',
  nonalphamin: 'कृपया कम से कम {0} गैर-अक्षर वर्ण दर्ज करें।',
});
