import dv from '..';

/**
 * Localized messages for locale: KA
 */
dv.localize({
  required: 'ამ ველის შევსება აუცილებელია.',
  email: 'გთხოვთ მიუთითოთ ელ-ფოსტის კორექტული მისამართი.',
  url: 'გთხოვთ მიუთითოთ კორექტული URL.',
  date: 'გთხოვთ მიუთითოთ კორექტული თარიღი.',
  dateISO: 'გთხოვთ მიუთითოთ კორექტული თარიღი ISO ფორმატში.',
  number: 'გთხოვთ მიუთითოთ ციფრი.',
  digits: 'გთხოვთ მიუთითოთ მხოლოდ ციფრები.',
  equalTo: 'გთხოვთ მიუთითოთ ასეთივე მნიშვნელობა კიდევ ერთხელ.',
  maxlength: 'დასაშვებია არაუმეტეს {0} სიმბოლო.',
  minlength: 'აუცილებელია შეიყვანოთ მინიმუმ {0} სიმბოლო.',
  rangelength: 'ტექსტში სიმბოლოების რაოდენობა უნდა იყოს {0}-დან {1}-მდე.',
  range: 'გთხოვთ შეიყვანოთ ციფრი {0}-დან {1}-მდე.',
  max: 'გთხოვთ შეიყვანოთ ციფრი რომელიც ნაკლებია ან უდრის {0}-ს.',
  min: 'გთხოვთ შეიყვანოთ ციფრი რომელიც მეტია ან უდრის {0}-ს.',
  creditcard: 'გთხოვთ მიუთითოთ საკრედიტო ბარათის კორექტული ნომერი.',
  regex: 'გთხოვთ შეიყვანოთ მნიშვნელობა, რომელიც შეესაბამება ნიმუშს {0}.',
  nonalphamin: 'გთხოვთ შეიყვანოთ მინიმუმ {0} არაალფაბეტური სიმბოლო.',
});
