import dv from '..';

/**
 * Localized messages for locale: JA
 */
dv.localize({
  required: 'このフィールドは必須です。',
  email: '有効なEメールアドレスを入力してください。',
  url: '有効なURLを入力してください。',
  date: '有効な日付を入力してください。',
  dateISO: '有効な日付（ISO）を入力してください。',
  number: '有効な数字を入力してください。',
  digits: '数字のみを入力してください。',
  equalTo: '同じ値をもう一度入力してください。',
  maxlength: '{0} 文字以内で入力してください。',
  minlength: '{0} 文字以上で入力してください。',
  rangelength: '{0} 文字から {1} 文字までの値を入力してください。',
  range: '{0} から {1} までの値を入力してください。',
  max: '{0} 以下の値を入力してください。',
  min: '{0} 以上の値を入力してください。',
  creditcard: '有効なクレジットカード番号を入力してください。',
  regex: 'パターン {0} に一致する値を入力してください。',
  nonalphamin: '少なくとも {0} 個の英字以外の文字を入力してください。',
});
