import dv from '..';

/**
 * Localized messages for locale: TJ
 */
dv.localize({
  required: 'Ворид кардани ин филд маҷбури аст.',
  email: 'Илтимос, почтаи электронии саҳеҳ ворид кунед.',
  url: 'Илтимос, URL адреси саҳеҳ ворид кунед.',
  date: 'Илтимос, таърихи саҳеҳ ворид кунед.',
  dateISO: 'Илтимос, таърихи саҳеҳи (ISO)ӣ ворид кунед.',
  number: 'Илтимос, рақамҳои саҳеҳ ворид кунед.',
  digits: 'Илтимос, танҳо рақам ворид кунед.',
  equalTo: 'Илтимос, миқдори баробар ворид кунед.',
  maxlength: 'Илтимос, бештар аз {0} рамз ворид накунед.',
  minlength: 'Илтимос, камтар аз {0} рамз ворид накунед.',
  rangelength: 'Илтимос, камтар аз {0} ва зиёда аз {1} рамз ворид кунед.',
  range: 'Илтимос, аз {0} то {1} рақам зиёд ворид кунед.',
  max: 'Илтимос, бештар аз {0} рақам ворид накунед.',
  min: 'Илтимос, камтар аз {0} рақам ворид накунед.',
  creditcard: 'Илтимос, кредит карди саҳеҳ ворид кунед.',
  regex: 'Лутфан қимате ворид кунед, ки ба намуна {0} мувофиқат кунад.',
  nonalphamin: 'Лутфан ҳадди ақал {0} аломатҳои ғайриалифбоӣ ворид кунед.',
});
