import dv from '..';

/**
 * Localized messages for locale: AR
 */
dv.localize({
  required: 'هذا الحقل إلزامي',
  email: 'رجاء إدخال عنوان بريد إلكتروني صحيح',
  url: 'رجاء إدخال عنوان موقع إلكتروني صحيح',
  date: 'رجاء إدخال تاريخ صحيح',
  dateISO: 'رجاء إدخال تاريخ صحيح (ISO)',
  number: 'رجاء إدخال عدد بطريقة صحيحة',
  digits: 'رجاء إدخال أرقام فقط',
  equalTo: 'رجاء إدخال نفس القيمة',
  maxlength: 'الحد الأقصى لعدد الحروف هو {0}',
  minlength: 'الحد الأدنى لعدد الحروف هو {0}',
  rangelength: 'عدد الحروف يجب أن يكون بين {0} و {1}',
  range: 'رجاء إدخال عدد قيمته بين {0} و {1}',
  max: 'رجاء إدخال عدد أقل من أو يساوي {0}',
  min: 'رجاء إدخال عدد أكبر من أو يساوي {0}',
  creditcard: 'رجاء إدخال رقم بطاقة ائتمان صحيح',
  regex: 'الرجاء إدخال قيمة تطابق النمط {0}',
  nonalphamin: 'الرجاء إدخال {0} حرفًا غير أبجدي على الأقل',
});
