import dv from '..';

/**
 * Localized messages for locale: HY_AM
 */
dv.localize({
  required: 'Պարտադիր լրացման դաշտ',
  email: 'Ներմուծեք վավեր էլեկտրոնային փոստի հասցե',
  url: 'Ներմուծեք վավեր URL',
  date: 'Ներմուծեք վավեր ամսաթիվ',
  dateISO: 'Ներմուծեք ISO ֆորմատով վավեր ամսաթիվ։',
  number: 'Ներմուծեք թիվ',
  digits: 'Ներմուծեք միայն թվեր',
  equalTo: 'Ներմուծեք միևնուն արժեքը ևս մեկ անգամ',
  maxlength: 'Ներմուծեք ոչ ավել քան {0} նիշ',
  minlength: 'Ներմուծեք ոչ պակաս քան {0} նիշ',
  rangelength: 'Ներմուծեք {0}֊ից {1} երկարությամբ արժեք',
  range: 'Ներմուծեք թիվ {0}֊ից {1} միջակայքում',
  max: 'Ներմուծեք թիվ, որը փոքր կամ հավասար է {0}֊ին',
  min: 'Ներմուծեք թիվ, որը մեծ կամ հավասար է {0}֊ին',
  creditcard: 'Ներմուծեք ճիշտ բանկային քարտի համար',
  regex: 'Խնդրում ենք մուտքագրել արժեք, որը համապատասխանում է {0} նմուշին:',
  nonalphamin: 'Խնդրում ենք մուտքագրել նվազագույնը {0} ոչ այբբենական նիշեր:',
});
