import dv from '..';

/**
 * Localized messages for locale: FA
 */
dv.localize({
  required: 'تکمیل این فیلد اجباری است.',
  email: 'لطفا یک ایمیل صحیح وارد کنید.',
  url: 'لطفا آدرس صحیح وارد کنید.',
  date: 'لطفا تاریخ صحیح وارد کنید.',
  dateISO: 'لطفا تاریخ صحیح وارد کنید (ISO).',
  number: 'لطفا عدد صحیح وارد کنید.',
  digits: 'لطفا تنها رقم وارد کنید.',
  equalTo: 'لطفا مقدار برابری وارد کنید.',
  maxlength: 'لطفا بیشتر از {0} حرف وارد نکنید.',
  minlength: 'لطفا کمتر از {0} حرف وارد نکنید.',
  rangelength: 'لطفا مقداری بین {0} تا {1} حرف وارد کنید.',
  range: 'لطفا مقداری بین {0} تا {1} حرف وارد کنید.',
  max: 'لطفا مقداری کمتر از {0} وارد کنید.',
  min: 'لطفا مقداری بیشتر از {0} وارد کنید.',
  creditcard: 'لطفا کریدیت کارت صحیح وارد کنید.',
  regex: 'لطفاً مقداری وارد کنید که با الگوی {0} مطابقت داشته باشد.',
  nonalphamin: 'لطفاً حداقل {0} کاراکتر غیر حروف الفبا وارد کنید.',
});
