import dv from '..';

/**
 * Localized messages for locale: HE
 */
dv.localize({
  required: 'השדה הזה הינו שדה חובה',
  email: 'נא למלא כתובת דוא\"ל חוקית',
  url: 'נא למלא כתובת אינטרנט חוקית',
  date: 'נא למלא תאריך חוקי',
  dateISO: 'נא למלא תאריך חוקי (ISO)',
  number: 'נא למלא מספר',
  digits: 'נא למלא רק מספרים',
  equalTo: 'נא למלא את אותו ערך שוב',
  maxlength: '.נא לא למלא יותר מ- {0} תווים',
  minlength: 'נא למלא לפחות {0} תווים',
  rangelength: 'נא למלא ערך בין {0} ל- {1} תווים',
  range: 'נא למלא ערך בין {0} ל- {1}',
  max: 'נא למלא ערך קטן או שווה ל- {0}',
  min: 'נא למלא ערך גדול או שווה ל- {0}',
  creditcard: 'נא למלא מספר כרטיס אשראי חוקי',
  regex: 'אנא הזן ערך התואם לתבנית {0}.',
  nonalphamin: 'אנא הזן לפחות {0} תווים שאינם אלפבתיים.',
});
