import dv from '..';

/**
 * Localized messages for locale: BN_BD
 */
dv.localize({
  required: 'এই তথ্যটি আবশ্যক।',
  email: 'অনুগ্রহ করে একটি সঠিক মেইল ঠিকানা লিখুন।',
  url: 'অনুগ্রহ করে একটি সঠিক লিঙ্ক দিন।',
  date: 'তারিখ সঠিক নয়।',
  dateISO: 'অনুগ্রহ করে একটি সঠিক (ISO) তারিখ লিখুন।',
  number: 'অনুগ্রহ করে একটি সঠিক নম্বর লিখুন।',
  digits: 'এখানে শুধু সংখ্যা ব্যবহার করা যাবে।',
  equalTo: 'একই মান আবার লিখুন।',
  maxlength: '{0}টির বেশি অক্ষর লেখা যাবে না।',
  minlength: '{0}টির কম অক্ষর লেখা যাবে না।',
  rangelength: '{0} থেকে {1} টি অক্ষর সম্বলিত মান লিখুন।',
  range: '{0} থেকে {1} এর মধ্যে একটি মান ব্যবহার করুন।',
  max: 'অনুগ্রহ করে {0} বা তার চাইতে কম মান ব্যবহার করুন।',
  min: 'অনুগ্রহ করে {0} বা তার চাইতে বেশি মান ব্যবহার করুন।',
  creditcard: 'অনুগ্রহ করে একটি ক্রেডিট কার্ডের সঠিক নম্বর লিখুন।',
  regex: 'অনুগ্রহ করে প্যাটার্ন {0} এর সাথে মেলে এমন মান লিখুন।',
  nonalphamin: 'অনুগ্রহ করে কমপক্ষে {0} টি অক্ষর নয় এমন অক্ষর লিখুন।',
});
