import dv from '..';

/**
 * Localized messages for locale: KK
 */
dv.localize({
  required: 'Бұл өрісті міндетті түрде толтырыңыз.',
  email: 'Нақты электронды поштаңызды енгізуіңізді сұраймыз.',
  url: 'Нақты URL-ды енгізуіңізді сұраймыз.',
  date: 'Нақты URL-ды енгізуіңізді сұраймыз.',
  dateISO: 'Нақты ISO форматымен сәйкес датасын енгізуіңізді сұраймыз.',
  number: 'Күнді енгізуіңізді сұраймыз.',
  digits: 'Тек қана сандарды енгізуіңізді сұраймыз.',
  equalTo: 'Осы мәнді қайта енгізуіңізді сұраймыз.',
  maxlength: 'Ұзындығы {0} символдан көр болмасын.',
  minlength: 'Ұзындығы {0} символдан аз болмасын.',
  rangelength: 'Ұзындығы {0}-{1} дейін мән енгізуіңізді сұраймыз.',
  range:
    'Пожалуйста, введите число от {0} до {1}. - {0} - {1} санын енгізуіңізді сұраймыз.',
  max: '{0} аз немесе тең санын енгізуіңіді сұраймыз.',
  min: '{0} көп немесе тең санын енгізуіңізді сұраймыз.',
  creditcard: 'Несие картасының нөмірін дұрыс енгізуіңізді сұраймыз.',
  regex: '{0} үлгісіне сәйкес келетін мәнді енгізіңіз.',
  nonalphamin: 'Кемінде {0} әріптік емес таңбаларды енгізіңіз.',
});
