import dv from '..';

/**
 * Localized messages for locale: GE
 */
dv.localize({
  required: 'ეს ველი სავალდებულოა.',
  email: 'გთხოვთ შეიყვანოთ სწორი ფორმატით.',
  url: 'გთხოვთ შეიყვანოთ სწორი ფორმატით.',
  date: 'გთხოვთ შეიყვანოთ სწორი თარიღი.',
  dateISO: 'გთხოვთ შეიყვანოთ სწორი ფორმატით (ISO).',
  number: 'გთხოვთ შეიყვანოთ რიცხვი.',
  digits: 'დაშვებულია მხოლოდ ციფრები.',
  equalTo: 'გთხოვთ შეიყვანოთ იგივე მნიშვნელობა.',
  maxlength: 'გთხოვთ შეიყვანოთ არა უმეტეს {0} სიმბოლოსი.',
  minlength: 'შეიყვანეთ მინიმუმ {0} სიმბოლო.',
  rangelength: 'გთხოვთ შეიყვანოთ {0} -დან {1} -მდე რაოდენობის სიმბოლოები.',
  range: 'შეიყვანეთ {0} -სა {1} -ს შორის.',
  max: 'გთხოვთ შეიყვანოთ მნიშვნელობა ნაკლები ან ტოლი {0} -ს.',
  min: 'გთხოვთ შეიყვანოთ მნიშვნელობა მეტი ან ტოლი {0} -ს.',
  creditcard: 'გთხოვთ შეიყვანოთ სწორი ფორმატის ბარათის კოდი.',
  regex: 'გთხოვთ შეიყვანოთ მნიშვნელობა, რომელიც შეესაბამება ნიმუშს {0}.',
  nonalphamin: 'გთხოვთ შეიყვანოთ მინიმუმ {0} არაალფაბეტური სიმბოლო.',
});
