import dv from '..';

/**
 * Localized messages for locale: SR
 */
dv.localize({
  required: 'Поље је обавезно.',
  email: 'Унесите исправну и-мејл адресу.',
  url: 'Унесите исправан URL.',
  date: 'Унесите исправан датум.',
  dateISO: 'Унесите исправан датум (ISO).',
  number: 'Унесите исправан број.',
  digits: 'Унесите само цифе.',
  equalTo: 'Унесите исту вредност поново.',
  maxlength: 'Унесите мање од {0} карактера.',
  minlength: 'Унесите барем {0} карактера.',
  rangelength: 'Унесите вредност дугачку између {0} и {1} карактера.',
  range: 'Унесите вредност између {0} и {1}.',
  max: 'Унесите вредност мању или једнаку {0}.',
  min: 'Унесите вредност већу или једнаку {0}.',
  creditcard: 'Унесите исправан број кредитне картице.',
  regex: 'Молимо унесите вредност која одговара шаблону {0}.',
  nonalphamin: 'Молимо унесите најмање {0} не-абецедних знакова.',
});
