import dv from '..';

/**
 * Localized messages for locale: UK
 */
dv.localize({
  required: 'Це поле необхідно заповнити.',
  email: 'Будь ласка, введіть коректну адресу електронної пошти.',
  url: 'Будь ласка, введіть коректний URL.',
  date: 'Будь ласка, введіть коректну дату.',
  dateISO: 'Будь ласка, введіть коректну дату у форматі ISO.',
  number: 'Будь ласка, введіть число.',
  digits: 'Вводите потрібно лише цифри.',
  equalTo: 'Будь ласка, введіть таке ж значення ще раз.',
  maxlength: 'Будь ласка, введіть не більше {0} символів.',
  minlength: 'Будь ласка, введіть не менше {0} символів.',
  rangelength: 'Будь ласка, введіть значення довжиною від {0} до {1} символів.',
  range: 'Будь ласка, введіть число від {0} до {1}.',
  max: 'Будь ласка, введіть число, менше або рівно {0}.',
  min: 'Будь ласка, введіть число, більше або рівно {0}.',
  creditcard: 'Будь ласка, введіть правильний номер кредитної карти.',
  regex: 'Будь ласка, введіть значення, що відповідає шаблону {0}.',
  nonalphamin: 'Будь ласка, введіть принаймні {0} не-алфавітних символів.',
});
