import dv from '..';

/**
 * Localized messages for locale: MK
 */
dv.localize({
  required: 'Полето е задолжително.',
  email: 'Внесете правилна e-mail адреса.',
  url: 'Внесете правилен URL.',
  date: 'Внесете правилен датум.',
  dateISO: 'Внесете правилен датум (ISO).',
  number: 'Внесете правилен број.',
  digits: 'Внесете само бројки.',
  equalTo: 'Внесете ја истата вредност повторно.',
  maxlength: 'Внесете максимално {0} знаци.',
  minlength: 'Внесете барем {0} знаци.',
  rangelength: 'Внесете вредност со должина помеѓу {0} и {1} знаци.',
  range: 'Внесете вредност помеѓу {0} и {1}.',
  max: 'Внесете вредност помала или еднаква на {0}.',
  min: 'Внесете вредност поголема или еднаква на {0}.',
  creditcard: 'Внесете правилен број на кредитната картичка.',
  regex: 'Ве молиме внесете вредност која се совпаѓа со шаблонот {0}.',
  nonalphamin: 'Ве молиме внесете најмалку {0} не-алфабетски знаци.',
});
