import dv from '..';

/**
 * Localized messages for locale: SD
 */
dv.localize({
  required: 'هنن جاين جي ضرورت آهي',
  email: 'لکيل اي ميل غلط آهي',
  url: 'لکيل ايڊريس غلط آهي',
  date: 'لکيل تاريخ غلط آهي',
  dateISO: 'جي معيار جي مطابق نه آهي (ISO) لکيل تاريخ',
  number: 'لکيل انگ صحيح ناهي',
  digits: 'رڳو انگ داخل ڪري سگهجي ٿو',
  equalTo: 'داخل ٿيل ڀيٽ صحيح نه آهي',
  maxlength: 'وڌ کان وڌ {0} جي داخلا ڪري سگهجي ٿي',
  minlength: 'گهٽ ۾ گهٽ {0} جي داخلا ڪرڻ ضروري آهي',
  rangelength: 'داخلا جو {0} ۽ {1}جي وچ ۾ هجڻ ضروري آهي',
  range: 'داخلا جو {0} ۽ {1}جي وچ ۾ هجڻ ضروري آهي',
  max: 'وڌ کان وڌ {0} جي داخلا ڪري سگهجي ٿي',
  min: 'گهٽ ۾ گهٽ {0} جي داخلا ڪرڻ ضروري آهي',
  creditcard: 'لکيل ڪارڊ نمبر صحيح نه آهي',
  regex: 'مهرباني ڪري هڪ قدر داخل ڪريو جيڪو نمونو {0} سان ملائي ٿو.',
  nonalphamin: 'مهرباني ڪري گهٽ ۾ گهٽ {0} غير حروف تهجي اکر داخل ڪريو.',
});
