import dv from '..';

/**
 * Localized messages for locale: RU
 */
dv.localize({
  required: 'Это поле необходимо заполнить.',
  email: 'Пожалуйста, введите корректный адрес электронной почты.',
  url: 'Пожалуйста, введите корректный URL.',
  date: 'Пожалуйста, введите корректную дату.',
  dateISO: 'Пожалуйста, введите корректную дату в формате ISO.',
  number: 'Пожалуйста, введите число.',
  digits: 'Пожалуйста, вводите только цифры.',
  equalTo: 'Пожалуйста, введите такое же значение ещё раз.',
  maxlength: 'Пожалуйста, введите не больше {0} символов.',
  minlength: 'Пожалуйста, введите не меньше {0} символов.',
  rangelength: 'Пожалуйста, введите значение длиной от {0} до {1} символов.',
  range: 'Пожалуйста, введите число от {0} до {1}.',
  max: 'Пожалуйста, введите число, меньшее или равное {0}.',
  min: 'Пожалуйста, введите число, большее или равное {0}.',
  creditcard: 'Пожалуйста, введите правильный номер кредитной карты.',
  regex: 'Пожалуйста, введите значение, соответствующее шаблону {0}.',
  nonalphamin: 'Пожалуйста, введите не менее {0} небуквенных символов.',
});
